# **link คำสั่งเพิ่มเติมเกี่ยวกับ sqlite3**

https://docs.python.org/3/library/sqlite3.html

#**เชื่อมต่อฐานข้อมูล test.db(Connect Database)**

In [12]:
import sqlite3

conn = sqlite3.connect('test.db')   # คำสั่งสร้าง Database 
									# test.db is database name
print("Opened database successfully")
conn.close()                        # attribute .close() ปิดการใช้งาน Database

Opened database successfully

# **สร้างตารางข้อมูล (Create Table)**

In [13]:
conn = sqlite3.connect('test.db')             # พึ่งปิดไปเมื่อกี้ ก็เลยต้องใช้ attribute .connect("database name")

# เชื่อมกับ SQL เพ่ือสร้าง table
with conn:

	# attribute ไว้เชื่อมกับ SQL
	# Table name = COMPANY
	conn.execute('''CREATE TABLE table_name
				 (ID            INT     PRIMARY KEY     NOT NULL,
				 NAME           TEXT    NOT NULL,
				 AGE            INT     NOT NULL,
				 ADDRESS        CHAR(50),
				 SALARY         REAL)''')

conn.close() # Do not forget close()
print("Table created successfully")

Table created successfully

# **แทรกข้อมูลในตาราง (Insert Data)**

In [14]:
conn = sqlite3.connect('test.db')

with conn:
  conn.execute("INSERT INTO table_name (ID,NAME,AGE,ADDRESS,SALARY) \
	  VALUES (1, 'Paul', 32, 'California', 20000.00 )")                 # การ insert ค่า เข้าไปใน database ใน field -> ID NAME AGE ADDRESS SALARY

  conn.execute("INSERT INTO table_name (ID,NAME,AGE,ADDRESS,SALARY) \
	  VALUES (2, 'Allen', 25, 'Texas', 15000.00 )")
conn.close()
print("Records created successfully")

Records created successfully

# **แทรกข้อมูลในตาราง แบบสั้น**

In [15]:
conn = sqlite3.connect('test.db') # connect ทุกครั้งที่ close

with conn:
	conn.execute("INSERT INTO table_name VALUES (3, 'Teddy', 23, 'Norway', 20000.00)")      # การ insert ค่า เข้าไปใน database ใน field แบบไม่กำหนด field จะเป็นการ insert แบบเรียงลำดับ
	conn.execute("INSERT INTO table_name VALUES (4, 'Mark', 25, 'Rich-Mond ', 65000.00)")
	conn.execute("INSERT INTO table_name VALUES (5, 'David', 27, 'Texas', 85000.00)")
	conn.execute("INSERT INTO table_name VALUES (6, 'Kim', 22, 'South-Hall', 45000.00)")
	conn.execute("INSERT INTO table_name VALUES (7, 'James', 24, 'Houston', 10000.00)")
	conn.execute("INSERT INTO table_name VALUES (8, 'Paul', 24, 'Houston', 20000.00)")
	conn.execute("INSERT INTO table_name VALUES (9, 'James', 44, 'Norway', 5000.00)")
	#conn.commit()

conn.close()
print("Records created successfully")

Records created successfully

# **สร้าง Utility สำหรับดูข้อมูล**

In [16]:
import numpy as np
import pandas as pd

def get_data(cursor):
	all_rows = cursor.fetchall()
	#[all_rows.append(np.array(row)) for row in cursor]
	column_names = [description[0] for description in cursor.description]
	df = pd.DataFrame(data=all_rows, columns = column_names)
	# ซ่อน index
	blankIndex=[''] * len(df)
	df.index=blankIndex
	return df

# **คิวรี่ข้อมูลจากตาราง(Select From Table)**

In [17]:
conn = sqlite3.connect('test.db')

with conn:
	cursor = conn.execute("SELECT * FROM table_name") # ใส่คำสั่ง SQL ลงไป เพื่อเป็นสะพานเชื่อมกับ SQL

df = get_data(cursor) # ช่วยโชว์ DATA
conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   1   Paul   32  California  20000.0
   2  Allen   25       Texas  15000.0
   3  Teddy   23      Norway  20000.0
   4   Mark   25  Rich-Mond   65000.0
   5  David   27       Texas  85000.0
   6    Kim   22  South-Hall  45000.0
   7  James   24     Houston  10000.0
   8   Paul   24     Houston  20000.0
   9  James   44      Norway   5000.0

# **แก้ไขตาราง**

**เปลี่ยนชื่อ Table**

In [18]:
conn = sqlite3.connect('test.db')

with conn:
	cursor = conn.execute("ALTER TABLE table_name RENAME TO OLD_COMPANY")

conn.close()
print("Operation done successfully")

Operation done successfully

**เพิ่มคอลัมน์**

In [19]:
conn = sqlite3.connect('test.db')

with conn:
	cursor = conn.execute("ALTER TABLE OLD_COMPANY ADD COLUMN SEX char(1)")

conn.close()
print("Operation done successfully")

Operation done successfully

**คิวรี่หลังการเปลี่ยนแปลง**

In [20]:
conn = sqlite3.connect('test.db')

with conn:
  cursor = conn.execute("SELECT * FROM OLD_COMPANY")

df=get_data(cursor)
conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY   SEX
   1   Paul   32  California  20000.0  None
   2  Allen   25       Texas  15000.0  None
   3  Teddy   23      Norway  20000.0  None
   4   Mark   25  Rich-Mond   65000.0  None
   5  David   27       Texas  85000.0  None
   6    Kim   22  South-Hall  45000.0  None
   7  James   24     Houston  10000.0  None
   8   Paul   24     Houston  20000.0  None
   9  James   44      Norway   5000.0  None

# **ลบตาราง(Drop Table)**

In [2]:
conn = sqlite3.connect('data_base_name.db')
with conn: 
	conn.execute("SQL Command")
conn.close()

In [21]:
conn = sqlite3.connect('test.db')

with conn:
  conn.execute("DROP table IF EXISTS OLD_COMPANY") 
  # IF EXISTS เป็นการยืนยันว่า table นี้มีอยู่จริง
  # DROP เป็นการลบ table ทิ้ง

conn.close()
print("Table dropped successfully")

Table dropped successfully

**จากข้างต้น Table จะถูกลบแล้ว จะต้องทำการสร้างตารางขึ้นใหม่**
# **AutoIncrement**
ตัวอย่างการสร้าง table โดยให้ primary key เป็น autoincrement

In [22]:
conn = sqlite3.connect('test.db')

with conn:
  conn.execute('''CREATE TABLE COMPANY
	  (ID INTEGER PRIMARY KEY AUTOINCREMENT,
	   NAME           TEXT    NOT NULL,
	   AGE            INT     NOT NULL,
	   ADDRESS        CHAR(50),
	   SALARY         REAL)
		   ''')

conn.close()
print("Table created successfully")

Table created successfully

**การเพิ่มข้อมูล โดยไม่ระบุ primary key**

In [23]:
conn = sqlite3.connect('test.db')

with conn:
	conn.execute("INSERT INTO COMPANY (NAME,AGE,ADDRESS,SALARY)\
						 VALUES ('Paul', 32, 'California', 20000.00 )")

	conn.execute("INSERT INTO COMPANY (NAME,AGE,ADDRESS,SALARY)\
						VALUES ('Allen', 25, 'Texas', 15000.00 )")

	conn.execute("INSERT INTO COMPANY (NAME,AGE,ADDRESS,SALARY)\
						VALUES ('Teddy', 23, 'Norway', 20000.00 )")

	conn.execute("INSERT INTO COMPANY (NAME,AGE,ADDRESS,SALARY)\
						VALUES ('Mark', 25, 'Rich-Mond ', 65000.00 )")

	conn.execute("INSERT INTO COMPANY (NAME,AGE,ADDRESS,SALARY)\
						VALUES ('David', 27, 'Texas', 85000.00 )")

	conn.execute("INSERT INTO COMPANY (NAME,AGE,ADDRESS,SALARY)\
						VALUES ('Kim', 22, 'South-Hall', 45000.00 )")

	conn.execute("INSERT INTO COMPANY (NAME,AGE,ADDRESS,SALARY)\
						VALUES ('James', 24, 'Houston', 10000.00)")

	conn.execute("INSERT INTO COMPANY (NAME,AGE,ADDRESS,SALARY)\
						VALUES ('Paul', 24, 'Houston', 20000.00)")

	conn.execute("INSERT INTO COMPANY (NAME,AGE,ADDRESS,SALARY)\
						VALUES ('James', 44, 'Norway', 5000.00)")
	#conn.commit()

print("Records created successfully")

Records created successfully

# **SELECT Query (การค้นหาข้อมูล)**

เริ่มจากการใช้ฟังก์ชันเพื่อแสดงข้อมูลจากการคิวรี่

In [24]:
conn = sqlite3.connect('test.db')

#cursor = conn.execute("SELECT id, name, age, salary from COMPANY")
cursor = conn.execute("SELECT * from COMPANY")
#Select query field of table
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   1   Paul   32  California  20000.0
   2  Allen   25       Texas  15000.0
   3  Teddy   23      Norway  20000.0
   4   Mark   25  Rich-Mond   65000.0
   5  David   27       Texas  85000.0
   6    Kim   22  South-Hall  45000.0
   7  James   24     Houston  10000.0
   8   Paul   24     Houston  20000.0
   9  James   44      Norway   5000.0

In [25]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT id, name, age, salary from COMPANY")
# cursor = conn.execute("SELECT * from COMPANY")
#Select query field of table
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE   SALARY
   1   Paul   32  20000.0
   2  Allen   25  15000.0
   3  Teddy   23  20000.0
   4   Mark   25  65000.0
   5  David   27  85000.0
   6    Kim   22  45000.0
   7  James   24  10000.0
   8   Paul   24  20000.0
   9  James   44   5000.0

In [26]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT id, name, age, salary from COMPANY WHERE AGE >=25")
# cursor = conn.execute("SELECT * from COMPANY")

#Select query field of table
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE   SALARY
   1   Paul   32  20000.0
   2  Allen   25  15000.0
   4   Mark   25  65000.0
   5  David   27  85000.0
   9  James   44   5000.0

**Where Clause**

การใช้ operator AND

In [27]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM COMPANY WHERE AGE >= 25 AND SALARY >= 65000")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   4   Mark   25  Rich-Mond   65000.0
   5  David   27       Texas  85000.0

การใช้ operator OR

In [28]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM COMPANY WHERE AGE >= 25 OR SALARY >= 65000")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   1   Paul   32  California  20000.0
   2  Allen   25       Texas  15000.0
   4   Mark   25  Rich-Mond   65000.0
   5  David   27       Texas  85000.0
   9  James   44      Norway   5000.0

การใช้ IS NULL กับ IS NOT NULL

In [29]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM COMPANY WHERE SALARY IS NULL")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

Empty DataFrame
Columns: [ID, NAME, AGE, ADDRESS, SALARY]
Index: []

In [30]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM COMPANY WHERE AGE IS NOT NULL")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   1   Paul   32  California  20000.0
   2  Allen   25       Texas  15000.0
   3  Teddy   23      Norway  20000.0
   4   Mark   25  Rich-Mond   65000.0
   5  David   27       Texas  85000.0
   6    Kim   22  South-Hall  45000.0
   7  James   24     Houston  10000.0
   8   Paul   24     Houston  20000.0
   9  James   44      Norway   5000.0

การใช้ LIKE

In [31]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM COMPANY WHERE age LIKE '2%'")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   2  Allen   25       Texas  15000.0
   3  Teddy   23      Norway  20000.0
   4   Mark   25  Rich-Mond   65000.0
   5  David   27       Texas  85000.0
   6    Kim   22  South-Hall  45000.0
   7  James   24     Houston  10000.0
   8   Paul   24     Houston  20000.0

In [32]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM COMPANY WHERE ADDRESS  LIKE '%-%'") # มี - อยู่ตรงกลาง
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID  NAME  AGE     ADDRESS   SALARY
   4  Mark   25  Rich-Mond   65000.0
   6   Kim   22  South-Hall  45000.0

การใช้ GLOB

In [33]:
conn = sqlite3.connect('test.db')

	
cursor = conn.execute("SELECT * FROM COMPANY WHERE NAME  LIKE '%s'") # มี - อยู่ตรงกลาง
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE  ADDRESS   SALARY
   7  James   24  Houston  10000.0
   9  James   44   Norway   5000.0

In [34]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM COMPANY WHERE ADDRESS GLOB '*ou*'") # มี ou อยู่งตรงไหนก็ได้ใน field ADDRESS แต่ต้องเป็น ou ไม่แยกกัน
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   6    Kim   22  South-Hall  45000.0
   7  James   24     Houston  10000.0
   8   Paul   24     Houston  20000.0

การใช้ operator IN กับ NOT IN

In [35]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM COMPANY WHERE AGE IN ( 25, 27 )")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   2  Allen   25       Texas  15000.0
   4   Mark   25  Rich-Mond   65000.0
   5  David   27       Texas  85000.0

In [36]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM COMPANY WHERE AGE NOT IN ( 25, 27 )")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   1   Paul   32  California  20000.0
   3  Teddy   23      Norway  20000.0
   6    Kim   22  South-Hall  45000.0
   7  James   24     Houston  10000.0
   8   Paul   24     Houston  20000.0
   9  James   44      Norway   5000.0

การใช้ operator BETWEEN

In [37]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM COMPANY WHERE AGE BETWEEN 25 AND 27") # ตั้งแต่ 25 - 27
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   2  Allen   25       Texas  15000.0
   4   Mark   25  Rich-Mond   65000.0
   5  David   27       Texas  85000.0

การใช้ประโยค sub-query

In [38]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT AGE FROM COMPANY WHERE SALARY > 65000")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  AGE
   27

In [39]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM COMPANY \
	WHERE AGE > (SELECT AGE FROM COMPANY WHERE SALARY > 65000)")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   1   Paul   32  California  20000.0
   9  James   44      Norway   5000.0

# **คำสั่ง DISTINCT**

ก่อนใช้ distinct

In [40]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT id, name, age, address, salary from COMPANY")
#Select query field of table
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   1   Paul   32  California  20000.0
   2  Allen   25       Texas  15000.0
   3  Teddy   23      Norway  20000.0
   4   Mark   25  Rich-Mond   65000.0
   5  David   27       Texas  85000.0
   6    Kim   22  South-Hall  45000.0
   7  James   24     Houston  10000.0
   8   Paul   24     Houston  20000.0
   9  James   44      Norway   5000.0

หลังใช้ DISTINCT

In [41]:
conn = sqlite3.connect('test.db') 

cursor = conn.execute("SELECT DISTINCT name,id, age FROM COMPANY") # name id age ที่ไม่ซ้ำกันทั้งหมด ตามการเรียง
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

   NAME  ID  AGE
   Paul   1   32
  Allen   2   25
  Teddy   3   23
   Mark   4   25
  David   5   27
    Kim   6   22
  James   7   24
   Paul   8   24
  James   9   44

# **การใช้ LIMIT**

In [97]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM COMPANY LIMIT 6") # จำกัด output สามารถนำมาประยุกต์ใช้กับ order by ได้ดี
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   3  Teddy   23      Norway  20000.0
   4   Mark   25  Rich-Mond   65000.0
   5  David   27       Texas  42500.0
   6    Kim   22  South-Hall  45000.0
   7  James   24     Houston  10000.0
   8   Paul   24     Houston  20000.0

# **การใช้ OFFSET ร่วมกับ LIMIT**

In [98]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM COMPANY LIMIT 3 OFFSET 2") # OFFSET คือการข้ามข้อมูล เช่น OFFSET=2 คือการข้าม 2 row แล้วเริ่มที่แถวที่ 3
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   5  David   27       Texas  42500.0
   6    Kim   22  South-Hall  45000.0
   7  James   24     Houston  10000.0

# **UPDATE QUERY**

In [44]:
conn = sqlite3.connect('test.db')

with conn:
	conn.execute("UPDATE COMPANY set SALARY = 25000.00 where ID = 1") # แก้ไขข้อมูล 
	print("Total number of rows updated :", conn.total_changes)

conn.close()
print("Operation done successfully")

Total number of rows updated : 1
Operation done successfully

In [45]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
#Select query field of table
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME     ADDRESS   SALARY
   1   Paul  California  25000.0
   2  Allen       Texas  15000.0
   3  Teddy      Norway  20000.0
   4   Mark  Rich-Mond   65000.0
   5  David       Texas  85000.0
   6    Kim  South-Hall  45000.0
   7  James     Houston  10000.0
   8   Paul     Houston  20000.0
   9  James      Norway   5000.0

# **Delete Query**

In [99]:
conn = sqlite3.connect('test.db')

with conn:
	conn.execute("DELETE from COMPANY where ID = 3") # Delete Row
	#ลบ record ที่มี id = 2
	print("Total number of rows deleted :", conn.total_changes)

cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
df = get_data(cursor)

conn.close()
print("Operation done successfully");df

Total number of rows deleted : 1
Operation done successfully

  ID   NAME     ADDRESS   SALARY
   4   Mark  Rich-Mond   65000.0
   5  David       Texas  42500.0
   6    Kim  South-Hall  45000.0
   7  James     Houston  10000.0
   8   Paul     Houston  20000.0

# **Commit กับ Rollback**

**ตัวอย่าง commit()**

In [119]:
conn = sqlite3.connect('test.db')

conn.execute("INSERT INTO COMPANY (NAME,AGE,ADDRESS,SALARY)\
			VALUES ('Manee', 35, 'Thailand', 45000.00)")
conn.commit() # 

cursor = conn.execute("SELECT id, name, age, address, salary from COMPANY")
df = get_data(cursor)

conn.close()
print("Operation done successfully");df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   4   Mark   25  Rich-Mond   65000.0
   5  David   27       Texas  42500.0
   6    Kim   22  South-Hall  45000.0
   7  James   24     Houston  10000.0
   8   Paul   24     Houston  20000.0
  11  Manee   35    Thailand  45000.0

**ตัวอย่าง rollback()**

In [118]:
conn = sqlite3.connect('test.db')

conn.execute("INSERT INTO COMPANY (NAME,AGE,ADDRESS,SALARY)\
			VALUES ('Mana', 15, 'Thailand', 15000.00)")
conn.rollback()

cursor = conn.execute("SELECT id, name, age, address, salary from COMPANY")
df = get_data(cursor)

conn.close()
print("Operation done successfully");
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   4   Mark   25  Rich-Mond   65000.0
   5  David   27       Texas  42500.0
   6    Kim   22  South-Hall  45000.0
   7  James   24     Houston  10000.0
   8   Paul   24     Houston  20000.0

# **เมื่อใช้ประโยค with**
* เมธอด commit()จะถูกเรียกอัตโนมัติหลังจากบล็อกทำงานเสร็จ
* เมธอด rollback() จะถูกเรียกอัตโนมัติเมื่อเกิด exception

In [49]:
conn = sqlite3.connect('test.db')

# Successful, con.commit() is called automatically afterwards
with conn:
	conn.execute("DELETE FROM COMPANY WHERE AGE = 35")
	print("Total number of rows deleted :", conn.total_changes)

# con.rollback() is called after the with block finishes with an exception, the
# exception is still raised and must be caught
try:
	with conn:
		conn.execute("DELETE FROM COMPANY WHERE AGE = 35")
except sqlite3.IntegrityError:
	print ("couldn't delete twice")

conn.close()

Total number of rows deleted : 1

In [50]:
conn = sqlite3.connect('test.db')
cursor = conn.execute("SELECT id, name, age, address, salary from COMPANY")
df = get_data(cursor)

conn.close()
print("Operation done successfully");
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   1   Paul   32  California  25000.0
   3  Teddy   23      Norway  20000.0
   4   Mark   25  Rich-Mond   65000.0
   5  David   27       Texas  85000.0
   6    Kim   22  South-Hall  45000.0
   7  James   24     Houston  10000.0
   8   Paul   24     Houston  20000.0
   9  James   44      Norway   5000.0

# **ประโยค ORDER BY**
ใช้ ASC : Ascending น้อยไปมาก

In [51]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM COMPANY ORDER BY SALARY ASC")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   9  James   44      Norway   5000.0
   7  James   24     Houston  10000.0
   3  Teddy   23      Norway  20000.0
   8   Paul   24     Houston  20000.0
   1   Paul   32  California  25000.0
   6    Kim   22  South-Hall  45000.0
   4   Mark   25  Rich-Mond   65000.0
   5  David   27       Texas  85000.0

In [52]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM COMPANY ORDER BY NAME, SALARY ASC")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   5  David   27       Texas  85000.0
   9  James   44      Norway   5000.0
   7  James   24     Houston  10000.0
   6    Kim   22  South-Hall  45000.0
   4   Mark   25  Rich-Mond   65000.0
   8   Paul   24     Houston  20000.0
   1   Paul   32  California  25000.0
   3  Teddy   23      Norway  20000.0

ใช้ DESC : Descanding มากไปน้อย

In [53]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM COMPANY ORDER BY NAME DESC")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   3  Teddy   23      Norway  20000.0
   1   Paul   32  California  25000.0
   8   Paul   24     Houston  20000.0
   4   Mark   25  Rich-Mond   65000.0
   6    Kim   22  South-Hall  45000.0
   7  James   24     Houston  10000.0
   9  James   44      Norway   5000.0
   5  David   27       Texas  85000.0

# **Group by**

In [105]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT address, avg(SALARY) AS Average_Salary FROM COMPANY GROUP BY address") # จัดกลุ่มสิ่งที่เหมือนกัน นิยมใช้กับการรวมกลุ่มที่เป็นแบบ count
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

     ADDRESS  Average_Salary
     Houston         15000.0
  Rich-Mond          65000.0
  South-Hall         45000.0
       Texas         42500.0

**group by ร่วมกับ order by**

In [55]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT NAME, SUM(SALARY) FROM COMPANY GROUP BY NAME ORDER BY NAME")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

   NAME  SUM(SALARY)
  David      85000.0
  James      15000.0
    Kim      45000.0
   Mark      65000.0
   Paul      45000.0
  Teddy      20000.0

# **การใช้ having กับ count**

In [56]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM COMPANY GROUP BY name HAVING count(name) < 2") # ขื่อที่มีจำนวน 1 เท่านั้น
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   5  David   27       Texas  85000.0
   6    Kim   22  South-Hall  45000.0
   4   Mark   25  Rich-Mond   65000.0
   3  Teddy   23      Norway  20000.0

In [57]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM COMPANY GROUP BY name HAVING count(name) >= 2")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   7  James   24     Houston  10000.0
   1   Paul   32  California  25000.0

# **JOIN**

ใช้กับ 2 ตารางขึ้นไป

สร้าง Table ใหม่ ชื่่อ department

In [58]:
conn = sqlite3.connect('test.db')

with conn:
	conn.execute('''CREATE TABLE DEPARTMENT(
	 ID INT PRIMARY KEY      NOT NULL,
	 DEPT           CHAR(50) NOT NULL,
	 EMP_ID         INT      NOT NULL
	);''')

conn.close()
print("Table created successfully")

Table created successfully

In [59]:
conn = sqlite3.connect('test.db')

with conn:
	conn.execute("INSERT INTO DEPARTMENT (ID, DEPT, EMP_ID) \
	VALUES (1, 'IT Billing', 1 )")

	conn.execute("INSERT INTO DEPARTMENT (ID, DEPT, EMP_ID) \
	VALUES (2, 'Engineering', 2 )")

	conn.execute("INSERT INTO DEPARTMENT (ID, DEPT, EMP_ID) \
	VALUES (3, 'Finance', 7 )")

conn.close()
print("Records created successfully")

Records created successfully

In [60]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT id, DEPT, EMP_ID from DEPARTMENT")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID         DEPT  EMP_ID
   1   IT Billing       1
   2  Engineering       2
   3      Finance       7

# **Cross Join**

In [61]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT EMP_ID, NAME, DEPT FROM COMPANY CROSS JOIN DEPARTMENT")
df = get_data(cursor)

print("Operation done successfully")
conn.close()
df

Operation done successfully

  EMP_ID   NAME         DEPT
       1   Paul   IT Billing
       2   Paul  Engineering
       7   Paul      Finance
       1  Teddy   IT Billing
       2  Teddy  Engineering
       7  Teddy      Finance
       1   Mark   IT Billing
       2   Mark  Engineering
       7   Mark      Finance
       1  David   IT Billing
       2  David  Engineering
       7  David      Finance
       1    Kim   IT Billing
       2    Kim  Engineering
       7    Kim      Finance
       1  James   IT Billing
       2  James  Engineering
       7  James      Finance
       1   Paul   IT Billing
       2   Paul  Engineering
       7   Paul      Finance
       1  James   IT Billing
       2  James  Engineering
       7  James      Finance

# **Inner Join**

In [62]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT EMP_ID, NAME, DEPT \
					 FROM COMPANY\
					 INNER JOIN DEPARTMENT \
					 ON COMPANY.ID = DEPARTMENT.EMP_ID")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  EMP_ID   NAME        DEPT
       1   Paul  IT Billing
       7  James     Finance

# **Outer Join**

In [108]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT EMP_ID, NAME, DEPT \
							 FROM COMPANY  \
							 LEFT OUTER JOIN DEPARTMENT \
	ON COMPANY.ID = DEPARTMENT.EMP_ID")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  EMP_ID   NAME     DEPT
     NaN   Mark     None
     NaN  David     None
     NaN    Kim     None
     7.0  James  Finance
     NaN   Paul     None

In [113]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT EMP_ID, NAME, DEPT \
					  FROM COMPANY \
					  RIGHT JOIN DEPARTMENT \
					  ON COMPANY.ID = DEPARTMENT.EMP_ID")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  EMP_ID   NAME         DEPT
       7  James      Finance
       1   None   IT Billing
       2   None  Engineering

# **UNION**

ข้อมูลจาก table **company**

In [64]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("select * from COMPANY")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   1   Paul   32  California  25000.0
   3  Teddy   23      Norway  20000.0
   4   Mark   25  Rich-Mond   65000.0
   5  David   27       Texas  85000.0
   6    Kim   22  South-Hall  45000.0
   7  James   24     Houston  10000.0
   8   Paul   24     Houston  20000.0
   9  James   44      Norway   5000.0

ข้อมูลจาก table **department**

In [65]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("select * from DEPARTMENT")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID         DEPT  EMP_ID
   1   IT Billing       1
   2  Engineering       2
   3      Finance       7

# **ใช้ UNION**

In [66]:
conn = sqlite3.connect('test.db')

cursor = conn.execute('''SELECT EMP_ID, NAME, DEPT FROM COMPANY INNER JOIN DEPARTMENT
		 ON COMPANY.ID = DEPARTMENT.EMP_ID

		 UNION

		 SELECT EMP_ID, NAME, DEPT FROM COMPANY LEFT OUTER JOIN DEPARTMENT
		 ON COMPANY.ID = DEPARTMENT.EMP_ID''')

df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  EMP_ID   NAME        DEPT
     NaN  David        None
     NaN  James        None
     NaN    Kim        None
     NaN   Mark        None
     NaN   Paul        None
     NaN  Teddy        None
     1.0   Paul  IT Billing
     7.0  James     Finance

# **ใช้ UNION ALL**

In [67]:
conn = sqlite3.connect('test.db')

cursor = conn.execute('''SELECT EMP_ID, NAME, DEPT FROM COMPANY INNER JOIN DEPARTMENT
		 ON COMPANY.ID = DEPARTMENT.EMP_ID

		 UNION ALL

		 SELECT EMP_ID, NAME, DEPT FROM COMPANY LEFT OUTER JOIN DEPARTMENT
		 ON COMPANY.ID = DEPARTMENT.EMP_ID;''')

df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  EMP_ID   NAME        DEPT
     1.0   Paul  IT Billing
     7.0  James     Finance
     1.0   Paul  IT Billing
     NaN  Teddy        None
     NaN   Mark        None
     NaN  David        None
     NaN    Kim        None
     7.0  James     Finance
     NaN   Paul        None
     NaN  James        None

# ใช้ ALIAS ตั้งชื่ออ้างอิง Table หรือคอลัมน์ใหม่

**อ้างอิง table**

In [68]:
conn = sqlite3.connect('test.db')

cursor = conn.execute('''SELECT C.ID, C.NAME, C.AGE, D.DEPT
				FROM COMPANY AS C, DEPARTMENT AS D
				WHERE  C.ID = D.EMP_ID''')
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE        DEPT
   1   Paul   32  IT Billing
   7  James   24     Finance

**อ้างอิงคอลัมน์**

In [69]:
conn = sqlite3.connect('test.db')

cursor = conn.execute('''SELECT C.ID AS COMPANY_ID, C.NAME AS COMPANY_NAME, C.AGE, D.DEPT
						  FROM COMPANY AS C, DEPARTMENT AS D
						  WHERE  C.ID = D.EMP_ID''')
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  COMPANY_ID COMPANY_NAME  AGE        DEPT
           1         Paul   32  IT Billing
           7        James   24     Finance

# **การจัดดำเนินการกับคิวรี่ย่อย**

## **SELECT**

In [70]:
conn = sqlite3.connect('test.db')

cursor = conn.execute('''SELECT *
	FROM COMPANY
	WHERE ID IN (SELECT ID
		FROM COMPANY
		WHERE SALARY > 45000)''')
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   4   Mark   25  Rich-Mond   65000.0
   5  David   27       Texas  85000.0

## **INSERT**

สร้าง table ชื่อ COMPANY_BKP

In [71]:
conn = sqlite3.connect('test.db')

with conn:
	conn.execute('''CREATE TABLE COMPANY_BKP
				 (ID INT PRIMARY KEY     NOT NULL,
				 NAME           TEXT    NOT NULL,
				 AGE            INT     NOT NULL,
				 ADDRESS        CHAR(50),
				 SALARY         REAL)''')

conn.close()
print("Table created successfully")

Table created successfully

In [72]:
conn = sqlite3.connect('test.db')

with conn:
	cursor = conn.execute('''INSERT INTO COMPANY_BKP
	 SELECT * FROM COMPANY
	 WHERE ID IN (SELECT ID
			FROM COMPANY)''') # เป็นการ Duplicate

conn.close()
print("Records created successfully")

Records created successfully

In [73]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM COMPANY_BKP")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   1   Paul   32  California  25000.0
   3  Teddy   23      Norway  20000.0
   4   Mark   25  Rich-Mond   65000.0
   5  David   27       Texas  85000.0
   6    Kim   22  South-Hall  45000.0
   7  James   24     Houston  10000.0
   8   Paul   24     Houston  20000.0
   9  James   44      Norway   5000.0

## **UPDATE**

In [74]:
conn = sqlite3.connect('test.db')

with conn:
	cursor = conn.execute('''UPDATE COMPANY
	 SET SALARY = SALARY * 0.50
	 WHERE AGE IN (SELECT AGE FROM COMPANY_BKP
			WHERE AGE >= 27 )''')

conn.close()
print("Records created successfully")

Records created successfully

In [75]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM COMPANY_BKP")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   1   Paul   32  California  25000.0
   3  Teddy   23      Norway  20000.0
   4   Mark   25  Rich-Mond   65000.0
   5  David   27       Texas  85000.0
   6    Kim   22  South-Hall  45000.0
   7  James   24     Houston  10000.0
   8   Paul   24     Houston  20000.0
   9  James   44      Norway   5000.0

In [76]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM COMPANY")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   1   Paul   32  California  12500.0
   3  Teddy   23      Norway  20000.0
   4   Mark   25  Rich-Mond   65000.0
   5  David   27       Texas  42500.0
   6    Kim   22  South-Hall  45000.0
   7  James   24     Houston  10000.0
   8   Paul   24     Houston  20000.0
   9  James   44      Norway   2500.0

## **DELETE**

In [77]:
conn = sqlite3.connect('test.db')

with conn:
	cursor = conn.execute('''DELETE FROM COMPANY
	 WHERE AGE IN (SELECT AGE FROM COMPANY_BKP
	 WHERE AGE > 27 )''')

cursor = conn.execute("SELECT * FROM COMPANY")
df = get_data(cursor)
conn.close()
print("Records created successfully")
df

Records created successfully

  ID   NAME  AGE     ADDRESS   SALARY
   3  Teddy   23      Norway  20000.0
   4   Mark   25  Rich-Mond   65000.0
   5  David   27       Texas  42500.0
   6    Kim   22  South-Hall  45000.0
   7  James   24     Houston  10000.0
   8   Paul   24     Houston  20000.0

In [78]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM COMPANY")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   3  Teddy   23      Norway  20000.0
   4   Mark   25  Rich-Mond   65000.0
   5  David   27       Texas  42500.0
   6    Kim   22  South-Hall  45000.0
   7  James   24     Houston  10000.0
   8   Paul   24     Houston  20000.0

# **การสร้าง INDEX**

In [79]:
conn = sqlite3.connect('test.db')

with conn:
	cursor = conn.execute("CREATE INDEX salary_index ON COMPANY (salary)")

conn.close()
print("Operation done successfully")

Operation done successfully

**Seach by index**

In [80]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM sqlite_master WHERE type = 'index'")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

,type,name,tbl_name,rootpage,sql
,index,sqlite_autoindex_DEPARTMENT_1,DEPARTMENT,5,None
,index,sqlite_autoindex_COMPANY_BKP_1,COMPANY_BKP,7,None
,index,salary_index,COMPANY,8,CREATE INDEX salary_index ON COMPANY (salary)

**Select ร่วมกับ index**

In [81]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM COMPANY INDEXED BY salary_index \
					   WHERE salary > 5000")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE     ADDRESS   SALARY
   7  James   24     Houston  10000.0
   3  Teddy   23      Norway  20000.0
   8   Paul   24     Houston  20000.0
   5  David   27       Texas  42500.0
   6    Kim   22  South-Hall  45000.0
   4   Mark   25  Rich-Mond   65000.0

**ลบ index**

In [82]:
conn = sqlite3.connect('test.db')

with conn:
	cursor = conn.execute("DROP INDEX salary_index")

conn.close()
print("Operation done successfully")

Operation done successfully

# **Views**

## การสร้าง View

In [83]:
conn = sqlite3.connect('test.db')

with conn:
	conn.execute('''CREATE VIEW COMPANY_VIEW AS
								SELECT ID, NAME, AGE
								FROM  COMPANY;''')

conn.close()
print("View created successfully")

View created successfully

# การแสดง View

In [84]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT * FROM COMPANY_VIEW")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID   NAME  AGE
   3  Teddy   23
   4   Mark   25
   5  David   27
   6    Kim   22
   7  James   24
   8   Paul   24

# การลบ View

In [85]:
conn = sqlite3.connect('test.db')

with conn:
	cursor = conn.execute("DROP VIEW COMPANY_VIEW")

conn.close()
print("Operation done successfully")

Operation done successfully

# **ฟังก์ชัน (รองรับ SQLite)**

ฟังก์ชัน count นับจำนวนแถวของ Table

In [86]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT count(*) FROM COMPANY")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  count(*)
         6

ฟังก์ชัน max ให้ค่ามากสุดของคอลัมน์นั้น

In [87]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT max(salary) FROM COMPANY")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  max(salary)
      65000.0

ฟังก์ชัน min ให้ค่าต่ำสุดของคอลัมน์นั้น

In [88]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT min(salary) FROM COMPANY")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  min(salary)
      10000.0

ฟังก์ชัน avg ให้ค่าเฉลี่ยของคอลัมน์นั้น

In [89]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT avg(salary) FROM COMPANY")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  avg(salary)
      33750.0

ฟังก์ชัน sum ให้ค่าผลรวมของคอลัมน์นั้น

In [90]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT sum(salary) FROM COMPANY")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  sum(salary)
     202500.0

ฟังก์ชัน random จะให้ค่าจำนวเต็มระหว่าง -9223372036854775808 กับ +9223372036854775807

In [117]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT random() AS Random")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

               Random
 -8551607294400882937

ฟังก์ชัน abs, upper, lower, length

In [92]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT abs(5), abs(-15), abs(NULL), abs(0), abs('ABC')")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

  abs(5)  abs(-15) abs(NULL)  abs(0)  abs('ABC')
       5        15      None       0         0.0

In [93]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT upper(name) FROM COMPANY") # Upper case
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

 upper(name)
       TEDDY
        MARK
       DAVID
         KIM
       JAMES
        PAUL

In [94]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT lower(name) FROM COMPANY") # Lower Case
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

 lower(name)
       teddy
        mark
       david
         kim
       james
        paul

In [95]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT name, length(name) FROM COMPANY")
df = get_data(cursor)

conn.close()
print("Operation done successfully")
df

Operation done successfully

   NAME  length(name)
  Teddy             5
   Mark             4
  David             5
    Kim             3
  James             5
   Paul             4